tukano-artillery-tests/logs/db-hibernate-5.txt
--------------------------------
Summary report @ 00:27:00(+0000)
--------------------------------

http.codes.200: ................................................................ 750
http.codes.204: ................................................................ 450
http.downloaded_bytes: ......................................................... 58661
http.request_rate: ............................................................. 37/sec
http.requests: ................................................................. 1200
http.response_time:
  min: ......................................................................... 125
  max: ......................................................................... 229
  mean: ........................................................................ 140.2
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 162.4
http.response_time.2xx:
  min: ......................................................................... 125
  max: ......................................................................... 229
  mean: ........................................................................ 140.2
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 162.4
http.responses: ................................................................ 1200
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 150
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 150
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 128
  max: ......................................................................... 175
  mean: ........................................................................ 140.6
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 162.4
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 133
  max: ......................................................................... 185
  mean: ........................................................................ 140.3
  median: ...................................................................... 138.4
  p95: ......................................................................... 149.9
  p99: ......................................................................... 159.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 130
  max: ......................................................................... 183
  mean: ........................................................................ 140.6
  median: ...................................................................... 138.4
  p95: ......................................................................... 156
  p99: ......................................................................... 162.4
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 125
  max: ......................................................................... 167
  mean: ........................................................................ 139.7
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 162.4
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 125
  max: ......................................................................... 160
  mean: ........................................................................ 139.7
  median: ...................................................................... 138.4
  p95: ......................................................................... 149.9
  p99: ......................................................................... 153
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 128
  max: ......................................................................... 229
  mean: ........................................................................ 141
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 172.5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 125
  max: ......................................................................... 163
  mean: ........................................................................ 138.7
  median: ...................................................................... 138.4
  p95: ......................................................................... 147
  p99: ......................................................................... 159.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 125
  max: ......................................................................... 173
  mean: ........................................................................ 140.5
  median: ...................................................................... 138.4
  p95: ......................................................................... 153
  p99: ......................................................................... 159.2
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1515.9
  max: ......................................................................... 1787.8
  mean: ........................................................................ 1592.4
  median: ...................................................................... 1587.9
  p95: ......................................................................... 1652.8
  p99: ......................................................................... 1720.2